N = 1
dd = []
s = [[50, 10, 100, 20, 40],
[30, 50, 70, 10, 60]]
s = [[10, 30, 10, 50, 100, 20, 40],
[20, 40, 30, 50, 60, 20, 80]]
n = 7



N = int(input())
for _ in range(N):
    n = int(input())
    dp = [[0] * n ,[0] *n]
    s = []
    [s.append(list(map(int, input().split()))) for _ in range(2)]
    
    dp[0][0], dp[1][0] = s[0][0], s[1][0]
    if n >= 2:
        dp[0][1] = s[1][0]+s[0][1]
        dp[1][1] = s[0][0]+s[1][1]
        for i in range(2,n):
            '''
            dp[0][i] = max(dp[0][i-2]+dp[1][i-1],  dp[1][i-2]) + s[0][i]
            dp[1][i] = max(dp[1][i-2]+dp[0][i-1],  dp[0][i-2]) + s[1][i]
            i-1의 대각선과 i-2의 같은선(합쳐서 지그재그)을 둘다 고려했었는데, 사실 i-1의 대각선에
            그 전 대각선것이 포함되어 있었음 // 그래서 2번째 전꺼의 동일선만 비교하면 됨
            '''
            dp[0][i] = max(dp[1][i-1], dp[1][i-2]) + s[0][i]
            dp[1][i] = max(dp[0][i-1], dp[0][i-2]) + s[1][i]
            print(dp)
    print(max(dp[0][n-1], dp[1][n-1]))